[
  {
    "id": "1a130f64-1834-4157-953e-2a0eaae57a64",
    "title": "How to improve SEO and social media preview of your website with React Helmet and Prerender service",
    "tags": ["javascript", "seo", "document meta", "social media", "social media preview", "social media meta tags", "react", "react helmet", "ssr", "prerender", "how to"],
    "brief": {
      "text": "Hard to imagine, but it's over 1 year since I created this blog, and up until recently, it always had static head tags. Title always being \"soofka.pl\", for example, wasn't that much of an issue to me, but social meta tags never related to the content of the post I'm sharing on Twitter, that was not cool (it's also not cool when it comes to SEO, but it's not that much of my concern right now). I finally had to tackle it. Here's a simple way to do it that I've found.",
      "imageFileName": "medieval-helmet-and-sword.jpg"
    },
    "created": "2018-09-14",
    "updated": "2018-10-01",
    "contentFileName": "how-to-improve-seo-and-social-media-preview-of-your-website-with-react-helmet-and-prerender-service.html",
    "public": true
  },
  {
    "id": "c52bd90a-7387-499f-8a07-9832d49392ee",
    "title": "Syntax highlighting in React with highlight.js and Web Worker",
    "tags": ["syntax highlighting", "javascript", "typescript", "react", "web worker", "how to"],
    "brief": {
      "text": "One of the most common issues I heard people have with my blog was lack of syntax highlighting in posts, especially those, which contain a lot of code. Okay, it's almost 2019, I'm software engineer, working mostly with front-end these times - I finally agreed, that it should be added. So I added it. And in the meantime, I also learned a little bit about Web Workers. Hence, this post, in which I describe this little adventure.",
      "imageFileName": "colorful-abstraction.jpg"
    },
    "created": "2018-09-08",
    "updated": "2018-09-08",
    "contentFileName": "syntax-highlighting-in-react-with-highlightjs-and-web-worker.html",
    "public": true
  },
  {
    "id": "9a6a22e7-6468-4f1e-a066-4e06c437d383",
    "title": "Moving from Sass to Styled Components (with snapshot tests)",
    "tags": ["javascript", "css", "sass", "css-in-js", "styled components", "jest", "snapshot tests", "how to"],
    "brief": {
      "text": "Who doesn't like to constantly rework perfectly fine stuff into something new and fancy just because it's trendy now? Well, probably pretty much every single JS developer, most certainly everyone who works with this language long enough to experience at least a glimpse of famous \"JS fatigue\" feeling (so approximately a few weeks). However, I created this blog as a playground to try out new libraries and frameworks, and since I'm learning Styled Components for my professional work at the moment, even though Sass-based styling worked perfectly for my needs, I reimplemented all of it into this controversial CSS-in-JS. And I'm still sane!",
      "imageFileName": "dubai-eye.jpg"
    },
    "created": "2018-08-20",
    "updated": "2018-08-21",
    "contentFileName": "moving-from-sass-to-styled-component-with-snapshot-tests.html",
    "public": true
  },
  {
    "id": "b0198de0-002b-47e2-a3c6-244314ddb757",
    "title": "My first MobX store (and how I wrote it)",
    "tags": ["javascript", "typescript", "react", "mobx", "store", "global app state", "how to"],
    "brief": {
      "text": "My dad wants to read my blog. The only issue is that he doesn't speak English very well. It's communicative, but it's not quite enough to understand intricate, sophisticated Shakespearean language, I am decorating my posts with. Worry not, father, as I've found the solution: language versions. I am currently working on adaptations of my posts in Polish language. In the meantime, I'm also adapting my codebase to be able to recognize and properly handle language parameter. And for that purpose, for the first time, I decided to use MobX.",
      "imageFileName": "react-mobx-typescript.jpg"
    },
    "created": "2018-08-13",
    "updated": "2018-08-16",
    "contentFileName": "my-first-mobx-store-and-how-i-wrote-it.html",
    "public": true
  },
  {
    "id": "528cc6f7-2559-4b94-b6f1-fa22003dedd5",
    "title": "Mocking and proxying HTTP requests from localhost with Webpack Dev Server or Express",
    "tags": ["javascript", "http", "mock", "proxy", "localhost", "webpack", "webpack-dev-server", "express", "how to"],
    "brief": {
      "text": "Back in the day, my JS projects were small and self-contained. Nowadays, in my professional work, majority, if not all of front-end applications I am working on are connected to multiple back-end services for variety of reasons. It gives me a freedom of not caring of the back-end, as long as we have defined a contract, and proceeding happily with what actually matters, i.e. colors and animations. But it also gave ma some headache, when I wanted to have pleasant, convenient coding environment on my localhost, and not have all of these weird back-end stuff running on my local machine as well. Here's how I worked it out with both Webpack Dev Server and Express.",
      "imageFileName": "eiffel-tower-and-some-people.jpg"
    },
    "created": "2018-07-23",
    "updated": "2018-07-23",
    "contentFileName": "mocking-and-proxying-http-requests-from-localhost-with-webpack-dev-server-or-express.html",
    "public": true
  },
  {
    "id": "ebbc221e-2e4f-456f-9e4b-035f9109bfd2",
    "title": "4 conferences I am looking forward to in 2nd half of 2018",
    "tags": ["javascript", "react", "front-end", "conference"],
    "brief": {
      "text": "At least every 6 months, I browse web to find interesting, upcoming IT conferences around the world and see if they fit my interests, budget, and calendar. Lately I'm focused particularly on front-end of web development. In this world, there are tons of events every weekend, on every, even tiniest and most specific subject. I find it challenging, to browse through hundreds of agendas, looking for accumulations of talks that seem to be time-worthy, so as I do my research, I try to share results as well. Here are they so far.",
      "imageFileName": "react-europe-2018-crowd.jpg"
    },
    "created": "2018-07-09",
    "updated": "2018-07-09",
    "contentFileName": "4-conferences-i-am-looking-forward-to-in-2nd-half-of-2018.html",
    "public": true
  },
  {
    "id": "eb54a4f6-0ff9-4750-b211-5f2d7675af70",
    "title": "React-Europe 2018: Summary of the talks",
    "tags": ["javascript", "react", "react-europe 2018", "conference"],
    "brief": {
      "text": "A couple of weeks ago I've visited Paris for the first time in my life. The city, although horribly crowded by tourists at all places, at all times (at least that's what it feels like), made me fell in love with it in only one weekend. I wouldn't have an opportunity for this magnificent experience, if it wasn't for React Europe - a conference, that took place in Paris on 17th and 18th of May, that was my primary goal of the trip. And, similarly to the city itself, the conference exceeded my expectations on many levels. Let me tell you how.",
      "imageFileName": "react-europe-2018-badge.jpg"
    },
    "created": "2018-06-03",
    "updated": "2018-07-09",
    "contentFileName": "react-europe-2018-summary-of-the-talks.html",
    "public": true
  },
  {
    "id": "289744b1-366d-4d07-8a32-d8588de0fe6b",
    "title": "Webpack 4 config explained (with example)",
    "tags": ["react", "redux", "typescript", "webpack"],
    "brief": {
      "text": "Using a skeleton for your application prepared by someone else comes with great benefit of a lot of time saved, but also with huge cost of a lot of knowledge not obtained. Sometimes you'll manage to complete your assignment just fine with some predefined boilerplate, without too much need for deep investigation of it's nooks and crannies. Other times, you'll end up in a position, where you reverse engineer it in order to introduce some major change, or just give up and start from scratch with your own thing. I wouldn't like you to give up on my application skeleton. Thus, I'll describe some of it's shenanigans in it's documentation. Today, I'm explaining build process.",
      "imageFileName": "the-doge-in-the-rye.jpg"
    },
    "created": "2018-04-09",
    "updated": "2018-06-02",
    "contentFileName": "webpack-4-config-explained-with-example.html",
    "public": true
  },
  {
    "id": "3c594f32-c9f0-47a2-a811-7a2ca2555026",
    "title": "I gave a lecture on Code Europe Autumn 2017 too!",
    "tags": ["react", "pwa", "case study", "code europe", "conference", "lecture"],
    "brief": {
      "text": "Yup, I did it again. Second big lecture in my life took place, similarly to my debut, on Code Europe in Warsaw, Poland, this time during Autumn 2017 edition. On the afternoon of 7th of December I talked about my experience with building Progressive Web Apps, particularly in React. It was a case study based on two examples: big, complex application built for hundreds of thousands of users of StepStone; and small, home-brewed one: this blog.",
      "imageFileName": "code-europe-autumn-2017-badge.jpg"
    },
    "created": "2018-04-04",
    "updated": "2018-04-04",
    "contentFileName": "i-gave-lecture-on-code-europe-autumn-2017-too.html",
    "public": true
  },
  {
    "id": "4b15b77b-c727-49fe-b0e6-91f5656b2682",
    "title": "How to setup routing for \"Not Found\" on both sides with React-Router and Express",
    "tags": ["javascript", "react", "react-router", "how to"],
    "brief": {
      "text": "When building web applications in React, I usually choose Express to be my server, and more often than not I use React-Router to manage redirections and changes in history. Not without a reason - both are among the most popular choices in their respective fields nowadays; both are simple and elegant in every day work. However, I had some tough moments with both of them when it came up to setting all unrecognized routing to \"Not Found\" page, and this piece came as a result of them.",
      "imageFileName": "colorful-tiles.jpg"
    },
    "created": "2018-03-26",
    "updated": "2018-03-26",
    "contentFileName": "how-to-setup-routing-for-not-found-on-both-sides-with-react-router-and-express.html",
    "public": true
  },
  {
    "id": "5c84ef0f-b7be-4aa9-af9b-dcf5d22028c6",
    "title": "3 things I learned in 2017",
    "tags": ["react", "typescript", "brain", "code europe", "public speaking"],
    "brief": {
      "text": "I like to improve myself – at least that’s what I like to think about myself. That’s the thought I had in mind most of 2017. Not every day, of course, but for most of them I tried to remember about it, to learn new things, and to at least try to better myself. So, when 2017 came to an end, I asked myself: what did I actually learn that year?",
      "imageFileName": "train-leaving.jpg"
    },
    "created": "2018-01-07",
    "updated": "2018-01-07",
    "contentFileName": "3-things-i-learned-in-2017.html",
    "public": true
  },
  {
    "id": "26bb42df-78cb-4eb8-8685-89ea78d2fd8c",
    "title": "FrontEnd-Con 2017: Summary",
    "tags": ["javascript", "css", "react", "angular", "frontend-con 2017", "conference"],
    "brief": {
      "text": "On 22nd and 23rd of September, there was FrontEnd Connect 2017 conference in Warsaw, Poland, and I was there. With plenty of speakers from around the globe and many news and announcements related to this event in polish Internet, I hoped for big, prestigious, and independent event focused on front-end of web development on my home soil. My expectations were utterly crushed, but I still had quite a good time.",
      "imageFileName": "frontend-con-2017-badge.jpg"
    },
    "created": "2017-09-26",
    "updated": "2017-09-26",
    "contentFileName": "frontend-con-2017-summary.html",
    "public": true
  },
  {
    "id": "7d0ac221-e911-4f02-9cc7-4cd95be8f244",
    "title": "How to integrate Disqus comments in React app",
    "tags": ["javascript", "react", "disqus", "how to"],
    "brief": {
      "text": "One of the challenges that I faced while programming this, so far, very simple blog app (the one that you are using to read this post, most likely), was how to give my readers a possibility to comment on my posts. Obviously, it is one of the crucial features of this kind of app – I would like my readers to be able to tell me where am I wrong, and I would like me to be able to respond to such heretic claims. However, the whole feature seems quite a lot of work to implement from scratch. Luckily, there are plenty of ready out of the box solutions out there, one of them being Disqus.",
      "imageFileName": "disqus-logo.jpg"
    },
    "created": "2017-08-08",
    "updated": "2018-06-02",
    "contentFileName": "how-to-integrate-disqus-comments-in-react-app.html",
    "public": true
  },
  {
    "id": "e16ac8a2-97cf-478a-bf9d-e29f55565929",
    "title": "I gave a lecture on Code Europe Spring 2017!",
    "tags": ["javascript", "optimization", "performance", "code europe", "conference", "lecture"],
    "brief": {
      "text": "That's right. Even before I became famous as a blog writer, I got an opportunity to give a lecture on one of the biggest IT conferences in Poland: Code Europe, Spring edition of year 2017. It was my first time as a speaker in front of crowd of that size and volume, so after a few weeks of panicky preparations, I managed to deliver presentation on how to optimize your JavaScript code with variety of tricks and techniques.",
      "imageFileName": "code-europe-spring-2017-badge.jpg"
    },
    "created": "2017-07-10",
    "updated": "2017-07-10",
    "contentFileName": "i-gave-lecture-on-code-europe-spring-2017.html",
    "public": true
  },
  {
    "id": "da1d29c9-5d66-4012-b73b-b4b45c708a20",
    "title": "On the surface",
    "tags": ["random"],
    "brief": {
      "text": "I am web developer. My job is to solve problems, usually related to software architecture or specific details of software implementation. During that process, I often find myself browsing the Internet, looking for people who had similar problems, solved them and described their solution. This kind of content is generally found either on internet forums or professional blogs. Since these sources provided me with, often very comprehensive, answers on countless occasions, I thought that the best way to appreciate their effort to share their knowledge would be to contribute to this knowledge base myself.",
      "imageFileName": "railroad-landscape.jpg"
    },
    "created": "2017-06-15",
    "updated": "2017-06-15",
    "contentFileName": "on-the-surface.html",
    "public": true
  }
]
